Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: README.freebsd - Perl version 5 on FreeBSD systems
es_es: README.freebsd - Perl versión 5 sobre sistemas FreeBSD

source: This document describes various features of FreeBSD that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es_es: Este documentos describe varias características de FreeBSD que afectarán a cómo Perl versión 5 (de ahora en adelante sólo Perl) es compilado y/o ejecutado.

source: =head2 FreeBSD core dumps from readdir_r with ithreads
es_es: =head2 FreeBSD vuelca el núcleo desde readdir_r con ithreads

source: When perl is configured to use ithreads, it will use re-entrant library calls in preference to non-re-entrant versions.
es_es: Cuando Perl está configurado para usar ithreads, usará llamadas de biblioteca reentrantes preferentemente sobre versiones no-reentrantes.

source: There is a bug in FreeBSD's C<readdir_r> function in versions 4.5 and earlier that can cause a SEGV when reading large directories.
es_es: Hay un bug en la función C<readdir_r> de FreeBSD en la versión 4.5 y anteriores que pueden provocar un SEGV al leer grandes directorios.

source: A patch for FreeBSD libc is available (see http://www.freebsd.org/cgi/query-pr.cgi?pr=misc/30631 ) which has been integrated into FreeBSD 4.6.
es_es: Un parche para la libc de FreeBSD está disponible (ver http://www.freebsd.org/cgi/query-pr.cgi?pr=misc/30631 ) y ha sido integrado en FreeBSD 4.6.

source: =head2 $^X doesn't always contain a full path in FreeBSD
es_es: =head2 $^X no siempre contiene el camino completo en FreeBSD

source: perl 5.8.0 sets C<$^X> where possible to a full path by asking the operating system.
es_es: perl 5.8.0 pone C<$^X> hasta donde sea posible a todo el camino completo preguntando al sistema operativo.

source: On FreeBSD the full path of the perl interpreter is found by reading the symlink F</proc/curproc/file>.
es_es: En FreeBSD el camino completo del intérprete perl se encuentra leyendo el enlace simbólico F</proc/curproc/file>.

source: There is a bug on FreeBSD, where the result of reading this symlink is can be wrong in certain circumstances (see http://www.freebsd.org/cgi/query-pr.cgi?pr=35703 ).
es_es: Hay un bug en FreeBSD, donde el resultado de leer un enlace simbólico puede ser erróneo en determinadas circunstancias (ver http://www.freebsd.org/cgi/query-pr.cgi?pr=35703 ).

source: In these cases perl will fall back to the old behaviour of using C's argv[0] value for C<$^X>.
es_es: En estos casos perl volverá al anterior comportamiento de usar el valor del C argv[0] para C<$^X>.

source: =head2 Perl will no longer be part of "base FreeBSD"
es_es: =head2 Perl ya no formará parte de la "base FreeBSD"

source: Not as bad as it sounds--what this means is that Perl will no longer be part of the B<kernel build system> of FreeBSD.
es_es: -No tan malo como suena- quiere decir que Perl ya no formará parte del B<sistema de construcción del kernel> de FreeBSD.

source: Perl will still very probably be part of the "default install", and in any case the latest version will be in the ports system.
es_es: Perl seguirá, probablemente, formando parte de la "instalación por defecto" y en cualquier caso la último versión será adaptada.

source: The first FreeBSD version this change will affect is 5.0, all 4.n versions will keep the status quo.
es_es: La primera versión FreeBSD con este cambio es 5.0. Todas las versiones 4.n mantendrán su status quo.

source: Nicholas Clark <nick@ccl4.org>, collating wisdom supplied by Slaven Rezic and Tim Bunce.
es_es: Nicholas Clark <nick@ccl4.org>, recopilando la sabiduría proporcionada por Slaven Rezic y Tim Bunce.

source: README.hurd - Perl version 5 on Hurd
es_es: README.hurd - Perl versión 5 sobre Hurd

source: If you want to use Perl on the Hurd, I recommend using the Debian GNU/Hurd distribution ( see http://www.debian.org/ ), even if an official, stable release has not yet been made.
es_es: Si quiere usar Perl sobre Hurd, le recomiendo usar la distribución Debian GNU/Hurd ( ver http://www.debian.org/ ), incluso aunque todavía no exista una versión estable.

source: The old `gnu-0.2' binary distribution will most certainly have additional problems.
es_es: La antigua distribución binaria `gnu-0.2' sigue teniendo problemas adicionales.

source: =head2 Known Problems with Perl on Hurd
es_es: =head2 Problemas conocidos de Perl sobre Hurd

source: The Perl test suite may still report some errors on the Hurd.
es_es: El conjunto de test Perl seguirá informando de algunos errores sobre Hurd.

source: The `lib/anydbm' and `pragma/warnings' tests will almost certainly fail.
es_es: Los test `lib/anydbm' y `pragma/warnings' seguirán fallando.

source: Both failures are not really specific to the Hurd, as indicated by the test suite output.
es_es: Ambos fallos realmente no son específicos a Hurd, como se indica en la salida de los test.

source: The socket tests may fail if the network is not configured.
es_es: El test de socket fallará si la red no está configurada.

source: You have to make `/hurd/pfinet' the translator for `/servers/socket/2', giving it the right arguments.
es_es: Deberá hacer `/hurd/pfinet' el traductor para el `/servers/socket/2', dándole los permisos adecuados.

source: Try `/hurd/pfinet --help' for more information.
es_es: Escriba `/hurd/pfinet --help' para más información.

source: Here are the statistics for Perl 5.005_62 on my system:
es_es: Aquí están las estadísticas de Perl 5.005_62 en mi sistema:

source: There are quite a few systems out there that do worse!
es_es: ¡Hay pocos sistemas que lo hagan peor!

source: However, since I am running a very recent Hurd snapshot, in which a lot of bugs that were exposed by the Perl test suite have been fixed, you may encounter more failures.
es_es: Sin embargo, desde que estoy corriendo en la reciente distribución de Hurd, y aunque un montón de errores expuestos por el conjunto de test de Perl han sido arreglados, usted puede encontrar más fallos.

source: Likely candidates are: `op/stat', `lib/io_pipe', `lib/io_sock', `lib/io_udp' and `lib/time'.
es_es: Los candidatos más probables son: `op/stat', `lib/io_pipe', `lib/io_sock', `lib/io_udp' y `lib/time'.

source: In any way, if you're seeing failures beyond those mentioned in this document, please consider upgrading to the latest Hurd before reporting the failure as a bug.
es_es: De cualquier forma, si está viendo fallos más allá de los aquí mencionados en este documento, considere, por favor, actualizar al último Hurd antes de informar del fallo como si fuera un bug.

source: README.macos - Perl under Mac OS (Classic)
es_es: README.macos - Perl bajo Mac OS (Classic)

source: This document briefly describes perl under Mac OS (Classic).
es_es: Este documento describe brevemente perl bajo Mac OS (Classic).

source: If you are running perl under Mac OS X, you don't want to be here (unless you are in the Classic environment under Mac OS X).
es_es: Si está corriendo perl bajo Mac OS X, no es necesario que siga leyendo (a menos que esté en un entorno Classic bajo Mac OS X).

source: When we say "Mac OS" below, we mean Mac OS 7, 8, and 9, and I<not> Mac OS X.
es_es: Cuando decimos bajo "Mac OS", queremos decir Mac OS 7, 8 y 9, y I<no> Mac OS X.

source: The latest perl source itself builds on Mac OS, with some additional pieces.
es_es: El último fuente perl se compila sobre Mac OS, con algunas piezas adicionales.

source: Support for Mac OS is now in the perl core, and MacPerl is kept in close sync with regular perl releases.
es_es: Soporte para Mac OS está ahora en el núcleo de perl, y MacPerl se sincroniza con los lanzamientos regulares de perl.

source: To build perl for Mac OS (as an MPW tool), you will need the addition of the F<macos> subdirectory, distributed separately.
es_es: Para construir perl para Mac OS (como una herramienta MPW), necesitará la adición del subdirectorio F<macos>, distribuido separadamente.

source: It includes extra source files, config files, and make files.
es_es: Incluye ficheros fuente adicionales, ficheros de configuración y ficheros make.

source: It also includes extra Mac-specific modules.
es_es: También incluye módulos adicionales específicos para Mac.

source: To build the MacPerl application, you will also need the F<macperl> directory, which includes the source files for creating the application itself.
es_es: Para construir la aplicación MacPerl, también necesitará el directorio F<macperl>, que incluye los ficheros fuente para crear la propia aplicación.

source: All of this is available from the development site, via HTTP (in the MacPerl Installer, which includes all the source and binaries) and anonymous CVS.
es_es: Todo esto está disponible desde el sitio de desarrollo, vía HTTP (en el instalador MacPerl, que incluye todo el fuente y binarios) y CVS de acceso anónimo.

source: The source is also in the main perl repository in the macperl branch (the 5.6 source is in the maint-5.6/macperl branch).
es_es: El fuente también está en el depósito principal de perl, en la rama macperl (el fuente 5.6 está en la rama maint-5.6/macperl).

source: You will also need compilers and libraries, all of them freely available.
es_es: También necesitará compiladores y librerías, todas ellas disponibles libremente.

source: These are linked to from the SourceForge site.
es_es: Están enlazadas desde el sitio de SourceForge.

source: Go that site for all things having to do with MacPerl development.
es_es: Vaya a este sitio para todo lo relacionado con el desarrollo de MacPerl.

source: MacPerl 5.6.1 and later are supported on Mac OS 8.1 and later, for 68040 and PowerPC architectures.
es_es: MacPerl 5.6.1 y siguientes están soportados en Mac OS 8.1 y siguients, para arquitecturas 68040 y PowerPC.

source: The MPW tool may be used on Mac OS 7.5.5 and 68030 computers.
es_es: La herramienta MPW puede ser usada sobre Mac OS 7.5.5 y ordenadores 68030.

source: MacPerl 5.2.0r4 is also available, on the CPAN and on SourceForge.
es_es: MacPerl 5.2.0r4 está también disponible en CPAN y en SourceForge.

source: It is based on perl 5.004, and works with Mac OS 7.5.5 and 68030 computers.
es_es: Está basada en perl 5.00 y funciona sobre Mac OS 7.5.5 y ordenadores 68030.

source: perl was ported to Mac OS by Matthias Neeracher E<lt>neeracher@mac.comE<gt>.
es_es: perl fue adaptado a Mac OS por Matthias Neeracher E<lt>neeracher@mac.comE<gt>.

source: It is currently maintained by Chris Nandor E<lt>pudge@pobox.comE<gt>.
es_es: Actualmente mantenido por Chris Nandor E<lt>pudge@pobox.comE<gt>.

source: =head1 DATE
es_es: =head1 FECHA

source: perlcheat - Perl 5 Cheat Sheet
es_es: perlcheat - Chuleta de Perl 5

source: This 'cheat sheet' is a handy reference, meant for beginning Perl programmers.
es_es: Esta 'chuleta' es una referencia rápida, para los programadores principiantes de Perl.

source: Not everything is mentioned, but 194 features may already be overwhelming.
es_es: No se menciona todo, porque 194 características pueden ser apabuyantes.

source: =head2 The sheet
es_es: =head2 La hoja

source: CONTEXTS SIGILS ARRAYS HASHES
es_es: CONTEXTO CARACT. ARRAYS HASHES

source: void $scalar whole: @array %hash
es_es: void $scalar completo: @array %hash

source: scalar @array slice: @array[0, 2] @hash{'a', 'b'}
es_es: scalar @array trozo: @array[0, 2] @hash{'a', 'b'}

source: list %hash element: $array[0] $hash{'a'}
es_es: list %hash elemento: $array[0] $hash{'a'}

source: number, string, reference, glob, undef
es_es: número, cadena, referencia, glob, undef

source: REFERENCES
es_es: REFERENCIAS

source: \ references $$foo[1] aka $foo->[1]
es_es: \ referencias $$foo[1] igual que $foo->[1]

source: $@%&* dereference $$foo{bar} aka $foo->{bar}
es_es: $@%&* desreferencia $$foo{bar} igual que $foo->{bar}

source: [] anon.
es_es: [] array

source: arrayref ${$$foo[1]}[2] aka $foo->[1]->[2]
es_es: anónimo ${$$foo[1]}[2] igual que $foo->[1]->[2]

source: {} anon.
es_es: {} hash

source: hashref ${$$foo[1]}[2] aka $foo->[1][2]
es_es: anónimo ${$$foo[1]}[2] igual que $foo->[1][2]

source: \() list of refs
es_es: \() lista de referencias

source: NUMBERS vs STRINGS LINKS
es_es: NÚMERoS vs CADENAS ENLACES

source: OPERATOR PRECEDENCE = = perl.plover.com
es_es: PRECEDENCIA de OPER. = = perl.plover.com

source: * / % x SYNTAX
es_es: * / % x SINTAXIS

source: named uops if ( ) { } elsif ( ) { } else { }
es_es: oper. con nombre if ( ) { } elsif ( ) { } else { }

source: == != <=> eq ne cmp for equals foreach (ALWAYS)
es_es: == != <=> eq ne cmp for igual a foreach (SIEMPRE)

source: | ^ REGEX METACHARS REGEX MODIFIERS
es_es: | ^ REGEX METACARACT. REGEX MODIFICADORES

source: && ^ string begin /i case insens.
es_es: && ^ comienzo de cadena /i may. y min.

source: || $ str.
es_es: || $ fin

# end (before ) /m line based ^$
source: end (before \n) /m line based ^$
es_es: cad. (antes \n) /m line based ^$

source: =head1 ACKNOWLEDGEMENTS
es_es: =head1 RECONOCIMIENTOS

source: The first version of this document appeared on Perl Monks, where several people had useful suggestions.
es_es: La primera versión de este documentos apareció en Perl Monks, en donde muchas personas dieron sus útiles sugerencias.

source: Thank you, Perl Monks.
es_es: Gracias, Perl Monks.

source: A special thanks to Damian Conway, who didn't only suggest important changes, but also took the time to count the number of listed features and make a Perl 6 version to show that Perl will stay Perl.
es_es: Un agradecimiento especial a Damian Conway, quien no sólo sugirió importantes cambios, sino que se tomó el tiempo suficiente para contar las características listadas y hacer una versión para Perl 6 y demostrar que Perl seguirá siendo Perl.

source: Juerd Waalboer <juerd@cpan.org>, with the help of many Perl Monks.
es_es: Juerd Waalboer <juerd@cpan.org>, con la ayuda de muchos Perl Monks.

source: http://perlmonks.org/?node_id=216602 the original PM post
es_es: http://perlmonks.org/?node_id=216602 la publicación original en PM

source: http://perlmonks.org/?node_id=238031 Damian Conway's Perl 6 version
es_es: http://perlmonks.org/?node_id=238031 Versión Perl 6 de Damian Conway

source: http://juerd.nl/site.plp/perlcheat home of the Perl Cheat Sheet
es_es: http://juerd.nl/site.plp/perlcheat Casa de la Chuleta Perl

source: A Perl program consists of a sequence of declarations and statements
es_es: Un programa Perl consiste de una secuencia de declaraciones e instrucciones of a sequence of declarations and statements

source: Long lines broken after an operator (except C<and> C<and> C<or>).
es_es: Dividir líneas largas después de un operador (excepto C<and> y C<or>).Long lines broken after an operator (except C<and> C<and> C<or>).

source: Long lines broken after an operator (except "and" and "or").
es_es: Líneas largas partidas después de un operador (excepto "and" y "or").

source: Avoid using grep() (or map()) or `backticks` in a void context, that is, when you just throw away their return values.
es_es: Evite usar grep() (o map()) o `backticks` en contexto nulos, es decir, cuando usted deshecha sus valores de retorno.

source: Otherwise use a foreach() loop or the system() function instead.
es_es: De otra forma, use un bucle foreach() o la función system().

source: While short identifiers like $gotit are probably ok, use underscores to separate words.
es_es: Mientras identificadores cortos como $leenombre están bien, use guiones bajos para separar palabras.

source: It is generally easier to read $var_names_like_this than $VarNamesLikeThis, especially for non-native speakers of English.
es_es: Generalmente es más fácil leer $var_nombres_como_este que $VarNombresComoEste, especialmente para los que no sean angloparlantes.

source: It's also a simple rule that works consistently with VAR_NAMES_LIKE_THIS.
es_es: Es una regla que funciona también con VAR_NOMBRES_COMO_ESTE.

source: E.g., $obj-E<gt>as_string().
es_es: Ejemplo, $obj-E<gt>como_cadena().

source: Use the new "and" and "or" operators to avoid having to parenthesize list operators so much, and to reduce the incidence of punctuation operators like C<&&> and C<||>.
es_es: Use los nuevos operadores "and" y "or" para evitar poner demasiados paréntesis en listas de operadores y para reducir la incidencia de la puntuación de operadores como C<&&> y C<||>.

source: Use here documents instead of repeated print() statements.
es_es: Use documentos incluídos en vez de repetidas instrucciones print().

source: Good error messages should go to STDERR, include which program caused the problem, what the failed system call and arguments were, and (VERY IMPORTANT) should contain the standard system error message for what went wrong.
es_es: Los buenos mensajes de error deben ir a STDERR, incluyendo qué programa causó el problema, qué función del sistema y qué argumentos fueron, y (MUY IMPORTANTE) debe contener el mensaje de error estándar del sistema por el cual falló.
